{
  "id": "soc2-type2",
  "name": "SOC 2 Type II",
  "version": "2017",
  "description": "Service Organization Control 2 - Trust Services Criteria for Security, Availability, Processing Integrity, Confidentiality, and Privacy",
  "source": "AICPA Trust Services Criteria",
  "category": "security",
  "requirements": [
    {
      "reference": "CC1",
      "title": "Control Environment",
      "description": "The criteria relevant to how the entity demonstrates commitment to integrity and ethical values.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC1.1",
          "title": "COSO Principle 1",
          "description": "The entity demonstrates a commitment to integrity and ethical values.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC1.2",
          "title": "COSO Principle 2",
          "description": "The board of directors demonstrates independence from management and exercises oversight of the development and performance of internal control.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC1.3",
          "title": "COSO Principle 3",
          "description": "Management establishes, with board oversight, structures, reporting lines, and appropriate authorities and responsibilities in the pursuit of objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC1.4",
          "title": "COSO Principle 4",
          "description": "The entity demonstrates a commitment to attract, develop, and retain competent individuals in alignment with objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC1.5",
          "title": "COSO Principle 5",
          "description": "The entity holds individuals accountable for their internal control responsibilities in the pursuit of objectives.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC2",
      "title": "Communication and Information",
      "description": "The criteria relevant to how the entity obtains or generates and uses relevant, quality information to support the functioning of internal control.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC2.1",
          "title": "COSO Principle 13",
          "description": "The entity obtains or generates and uses relevant, quality information to support the functioning of internal control.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC2.2",
          "title": "COSO Principle 14",
          "description": "The entity internally communicates information, including objectives and responsibilities for internal control, necessary to support the functioning of internal control.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC2.3",
          "title": "COSO Principle 15",
          "description": "The entity communicates with external parties regarding matters affecting the functioning of internal control.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC3",
      "title": "Risk Assessment",
      "description": "The criteria relevant to how the entity specifies objectives with sufficient clarity to enable the identification and assessment of risks relating to objectives.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC3.1",
          "title": "COSO Principle 6",
          "description": "The entity specifies objectives with sufficient clarity to enable the identification and assessment of risks relating to objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC3.2",
          "title": "COSO Principle 7",
          "description": "The entity identifies risks to the achievement of its objectives across the entity and analyzes risks as a basis for determining how the risks should be managed.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC3.3",
          "title": "COSO Principle 8",
          "description": "The entity considers the potential for fraud in assessing risks to the achievement of objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC3.4",
          "title": "COSO Principle 9",
          "description": "The entity identifies and assesses changes that could significantly impact the system of internal control.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC4",
      "title": "Monitoring Activities",
      "description": "The criteria relevant to how the entity selects, develops, and performs ongoing and/or separate evaluations to ascertain whether the components of internal control are present and functioning.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC4.1",
          "title": "COSO Principle 16",
          "description": "The entity selects, develops, and performs ongoing and/or separate evaluations to ascertain whether the components of internal control are present and functioning.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC4.2",
          "title": "COSO Principle 17",
          "description": "The entity evaluates and communicates internal control deficiencies in a timely manner to those parties responsible for taking corrective action, including senior management and the board of directors, as appropriate.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC5",
      "title": "Control Activities",
      "description": "The criteria relevant to how the entity selects and develops control activities that contribute to the mitigation of risks to the achievement of objectives to acceptable levels.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC5.1",
          "title": "COSO Principle 10",
          "description": "The entity selects and develops control activities that contribute to the mitigation of risks to the achievement of objectives to acceptable levels.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC5.2",
          "title": "COSO Principle 11",
          "description": "The entity also selects and develops general control activities over technology to support the achievement of objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC5.3",
          "title": "COSO Principle 12",
          "description": "The entity deploys control activities through policies that establish what is expected and procedures that put policies into action.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC6",
      "title": "Logical and Physical Access Controls",
      "description": "The criteria relevant to how the entity restricts logical and physical access to the system.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC6.1",
          "title": "Logical Access Security Software",
          "description": "The entity implements logical access security software, infrastructure, and architectures over protected information assets to protect them from security events to meet the entity's objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.2",
          "title": "User Registration and Authorization",
          "description": "Prior to issuing system credentials and granting system access, the entity registers and authorizes new internal and external users whose access is administered by the entity.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.3",
          "title": "Access Removal",
          "description": "The entity removes access to protected information assets when system access is no longer required.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.4",
          "title": "Access Review",
          "description": "The entity restricts physical access to facilities and protected information assets to authorized personnel to meet the entity's objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.5",
          "title": "Asset Disposal",
          "description": "The entity discontinues logical and physical protections over physical assets only after the ability to read or recover data and software from those assets has been diminished.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.6",
          "title": "Logical Access to External Parties",
          "description": "The entity implements logical access security measures to protect against threats from sources outside its system boundaries.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.7",
          "title": "Data Transmission Restriction",
          "description": "The entity restricts the transmission, movement, and removal of information to authorized internal and external users and processes.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC6.8",
          "title": "Malicious Software Prevention",
          "description": "The entity implements controls to prevent or detect and act upon the introduction of unauthorized or malicious software to meet the entity's objectives.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC7",
      "title": "System Operations",
      "description": "The criteria relevant to how the entity detects and monitors system configuration, operation, security, and changes.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC7.1",
          "title": "Security Event Detection",
          "description": "To meet its objectives, the entity uses detection and monitoring procedures to identify changes to configurations that result in the introduction of new vulnerabilities and susceptibilities to newly discovered vulnerabilities.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC7.2",
          "title": "Security Incident Monitoring",
          "description": "The entity monitors system components and the operation of those components for anomalies that are indicative of malicious acts, natural disasters, and errors affecting the entity's ability to meet its objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC7.3",
          "title": "Security Incident Analysis",
          "description": "The entity evaluates security events to determine whether they could or have resulted in a failure of the entity to meet its objectives and, if so, takes action to prevent or address such failures.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC7.4",
          "title": "Incident Response",
          "description": "The entity responds to identified security incidents by executing a defined incident response program to understand, contain, remediate, and communicate security incidents.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC7.5",
          "title": "Incident Recovery",
          "description": "The entity identifies, develops, and implements activities to recover from identified security incidents.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC8",
      "title": "Change Management",
      "description": "The criteria relevant to how the entity authorizes, designs, develops or acquires, configures, documents, tests, approves, and implements changes to infrastructure, data, software, and procedures.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC8.1",
          "title": "Change Authorization and Approval",
          "description": "The entity authorizes, designs, develops or acquires, configures, documents, tests, approves, and implements changes to infrastructure, data, software, and procedures to meet its objectives.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "CC9",
      "title": "Risk Mitigation",
      "description": "The criteria relevant to how the entity identifies, selects, and develops risk mitigation activities for risks arising from potential business disruptions.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "CC9.1",
          "title": "Business Disruption Risk Mitigation",
          "description": "The entity identifies, selects, and develops risk mitigation activities for risks arising from potential business disruptions.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "CC9.2",
          "title": "Vendor Risk Management",
          "description": "The entity assesses and manages risks associated with vendors and business partners.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "A1",
      "title": "Availability",
      "description": "Additional criteria for the availability category.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "A1.1",
          "title": "Capacity Management",
          "description": "The entity maintains, monitors, and evaluates current processing capacity and use of system components to manage capacity demand and to enable the implementation of additional capacity.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "A1.2",
          "title": "Environmental Protections",
          "description": "The entity authorizes, designs, develops or acquires, implements, operates, approves, maintains, and monitors environmental protections, software, data backup processes, and recovery infrastructure.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "A1.3",
          "title": "Recovery Testing",
          "description": "The entity tests recovery plan procedures supporting system recovery to meet its objectives.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "PI1",
      "title": "Processing Integrity",
      "description": "Additional criteria for the processing integrity category.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "PI1.1",
          "title": "Data Input Accuracy",
          "description": "The entity implements policies and procedures over system inputs that result in products, services, and reporting to meet the entity's objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "PI1.2",
          "title": "Processing Accuracy",
          "description": "The entity implements policies and procedures over system processing that result in products, services, and reporting to meet the entity's objectives.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "PI1.3",
          "title": "Output Completeness",
          "description": "The entity implements policies and procedures to make available or deliver output completely, accurately, and timely.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "PI1.4",
          "title": "Processing Errors",
          "description": "The entity implements policies and procedures to store inputs, items in processing, and outputs completely, accurately, and timely.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "PI1.5",
          "title": "Processing Integrity Monitoring",
          "description": "The entity implements policies and procedures to enable tracing of information inputs from their source to final disposition.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "C1",
      "title": "Confidentiality",
      "description": "Additional criteria for the confidentiality category.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "C1.1",
          "title": "Confidential Information Identification",
          "description": "The entity identifies and maintains confidential information to meet the entity's objectives related to confidentiality.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "C1.2",
          "title": "Confidential Information Disposal",
          "description": "The entity disposes of confidential information to meet the entity's objectives related to confidentiality.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P1",
      "title": "Privacy",
      "description": "Additional criteria for the privacy category - Notice and Communication of Objectives.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P1.1",
          "title": "Privacy Notice",
          "description": "The entity provides notice to data subjects about its privacy practices to meet the entity's objectives related to privacy.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P2",
      "title": "Privacy - Choice and Consent",
      "description": "Additional criteria for the privacy category - Choice and Consent.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P2.1",
          "title": "Choice and Consent",
          "description": "The entity communicates choices available regarding the collection, use, retention, disclosure, and disposal of personal information to data subjects.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P3",
      "title": "Privacy - Collection",
      "description": "Additional criteria for the privacy category - Collection.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P3.1",
          "title": "Personal Information Collection",
          "description": "Personal information is collected consistent with the entity's objectives related to privacy.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P3.2",
          "title": "Explicit Consent for Sensitive Information",
          "description": "For information requiring explicit consent, the entity communicates the need for such consent and obtains explicit consent.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P4",
      "title": "Privacy - Use, Retention, and Disposal",
      "description": "Additional criteria for the privacy category - Use, Retention, and Disposal.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P4.1",
          "title": "Limiting Use of Personal Information",
          "description": "The entity limits the use of personal information to the purposes identified in the entity's objectives related to privacy.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P4.2",
          "title": "Retention of Personal Information",
          "description": "The entity retains personal information consistent with the entity's objectives related to privacy.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P4.3",
          "title": "Disposal of Personal Information",
          "description": "The entity securely disposes of personal information to meet the entity's objectives related to privacy.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P5",
      "title": "Privacy - Access",
      "description": "Additional criteria for the privacy category - Access.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P5.1",
          "title": "Access to Personal Information",
          "description": "The entity grants identified and authenticated data subjects the ability to access their stored personal information for review.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P5.2",
          "title": "Correction of Personal Information",
          "description": "The entity corrects, amends, or appends personal information based on information provided by data subjects.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P6",
      "title": "Privacy - Disclosure and Notification",
      "description": "Additional criteria for the privacy category - Disclosure and Notification.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P6.1",
          "title": "Third-Party Disclosure",
          "description": "The entity discloses personal information to third parties with the explicit consent of data subjects.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P6.2",
          "title": "Notification of Changes",
          "description": "The entity notifies affected data subjects, regulators, and others when changes to the personal information system could impact their privacy.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P6.3",
          "title": "Privacy Incident Notification",
          "description": "The entity notifies affected data subjects, regulators, and others in the event of a privacy incident.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P6.4",
          "title": "Third-Party Agreements",
          "description": "The entity obtains privacy commitments from vendors and other third parties who have access to personal information.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P6.5",
          "title": "Third-Party Compliance Monitoring",
          "description": "The entity obtains commitments from vendors and other third parties with access to personal information to notify the entity in the event of actual or suspected unauthorized disclosures.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P6.6",
          "title": "Unauthorized Disclosure Notification",
          "description": "The entity provides notification of breaches and incidents to affected data subjects, regulators, and others.",
          "level": 1,
          "isCategory": false
        },
        {
          "reference": "P6.7",
          "title": "Accounting of Disclosures",
          "description": "The entity provides data subjects with an accounting of the personal information held and disclosure of the data subjects' personal information upon request.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P7",
      "title": "Privacy - Quality",
      "description": "Additional criteria for the privacy category - Quality.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P7.1",
          "title": "Personal Information Accuracy",
          "description": "The entity collects and maintains accurate, up-to-date, complete, and relevant personal information for the purposes identified in the notice.",
          "level": 1,
          "isCategory": false
        }
      ]
    },
    {
      "reference": "P8",
      "title": "Privacy - Monitoring and Enforcement",
      "description": "Additional criteria for the privacy category - Monitoring and Enforcement.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "P8.1",
          "title": "Privacy Compliance Review",
          "description": "The entity performs privacy reviews on a periodic basis to ensure that personal information policies are being followed.",
          "level": 1,
          "isCategory": false
        }
      ]
    }
  ]
}
